Repository: HeyTigrou/Projet-Programmation-Systeme
Catalog: easy_save.Cmd/Resources/Strings.*.resx
Languages: fr

# AllProcess.Cancel
source: Launch of all the processes canceled
fr: Annulation du lancement de tout les processus de sauvegarde

# AllProcess.Continue
source: ! Press enter to continue !
fr: ! Appuyer sur entrée pour continuer !

# AllProcess.EndProcess
source: => All backup processes have been launched correctly
fr: => Tous les processus de sauvegarde ont été lancés corrêctement

# AllProcess.Error
source: backup process could not be started
fr: processus de sauvegarde n'a / ont pas pu(s) être lancé(s)

# AllProcess.StartProcess
source: Enter [yes] if you want to launch all the save processes, anything other than [yes] will result in a cancel
fr: Entrer [oui] si vous voulez lancer tout les processus de sauvegarde, toute autre entrée que [oui] nous donnera une annulation

# BackupDetails.Continue
source: ! Press enter to continue !
fr: ! Appuyer sur entrée pour continuer !

# BackupDetails.Empty
source: => No save work available
fr: => Aucun processus de sauvegarde disponible

# BackupDetails.Presentation
source: Here are the available save works :
fr: Voici les travaux de sauvegarde disponibles :

# CancelWord
source: cancel
fr: annuler

# ConfirmWord
source: yes
fr: oui

# Main.Menu
source: 1| Create a new backup 2| Remove a backup 3| Start a backup 4| Start all available backup processes 5| View backup details 6| Exit
fr: 1| Créer un processus de sauvegarde 2| Supprimer une sauvegarde 3| Lancer une sauvegarde 4| Lancer tous les processus de sauvegarde disponible 5| Afficher les détails de sauvegarde 6| Quitter

# Main.Option
source: Enter an option:
fr: Choisir une option:

# ParameterPresentation
source: => These are your input parameters:
fr: => Voici vos paramètres d'entrée :

# Remove.Cancel
source: Deletion cancelled
fr: Suppression annulé

# Remove.ConfirmChoice
source: Enter [yes] to confirm the deletion of :
fr: Entrer [oui] pour confirmer la supression de :

# Remove.ConfirmChoice2
source: , enter [cancel] if you want to cancel the deletion process (leave empty to change name)
fr: , entrer [annuler] si vous voulez annuler le processus de supression (laisser vide si vous voulez changer le nom)

# Remove.Continue
source: ! Press enter to continue !
fr: ! Appuyer sur entrée pour continuer !

# Remove.MissingFile
source: => Backup process not found
fr: => Processus de sauvegarde non trouvé

# Remove.Name
source: Enter the name of the backup to delete
fr: Entrer le nom de la sauvegarde à supprimer

# Remove.SucessRemove
source: => Backup process removed
fr: => Processus de sauvegarde supprimé

# Save.Cancel
source: Creation cancelled
fr: Création annulé

# Save.ConfirmChoice
source: Enter [yes] if you want to create the save work, rentrer [cancel] if you want to exit the save processus creation (leave empty to re-enter your process parameters )
fr: Rentrer [oui] si vous voulez créer le travail de sauvegarde, rentrer [annuler] si vous voulez sortir de la création de processus de sauvegarde (laisser vide si vous voulez rentrer à nouveau le paramètres du processus)

# Save.Continue
source: ! Press enter to continue !
fr: ! Appuyer sur entrée pour continuer !

# Save.ErroLimit
source: => Maximum number of backup processes reached or name or name already taken, unable to create
fr: => Nombre de processus de sauvegarde maximum atteint ou nom déjà choisi, impossible de créer

# Save.ErrorInput
source: => Invalid input, please try again
fr: => Erreur d'entrée, veuillez recommencer

# Save.ErrorSaveType
source: => Invalid save type
fr: => Type de sauvegarde non valide

# Save.InputPath
source: Selected entry path:
fr: Chemin d'entrée choisi :

# Save.Name
source: Enter the name of your save
fr: Entrer le nom de la sauvegarde

# Save.OutputPath
source: Selected destination path:
fr: Chemin de sortie choisi :

# Save.PathDestination
source: Enter the path of the destination
fr: Enter le chemin de destination

# Save.PathSave
source: Enter the path of the file to save
fr: Enter le chemin de la sauvegarde

# Save.Process
source: => Backup process created
fr: => Processus de sauvegarde crée

# Save.SaveName
source: Name of the save project:
fr: Nom du projet de sauvegarde :

# Save.SaveType
source: Enter the type of save(0 : All files (chosen by default) / 1 : Changed files)
fr: Enter le type de sauvegarde (0 => Tous les fichiers (choisi par défaut) / 1 => Uniquement les fichiers modifiés)

# Save.SaveType2
source: Selected save type (0 -> Complete, 1 -> Incremental):
fr: Type de sauvegarde choisi (0 -> Complète, 1 -> Incrementielle) :

# SaveStart.ConfirmChoice
source: Enter [yes] to confirm the launch of this save process :
fr: Entrer [oui] pour confirmer le lancement du processus de sauvegarde suivant :

# SaveStart.ConfirmChoice2
source: , enter [cancel] if you want to cancel the launch of the save process (leave empty to select an other process)
fr: , entrer [annuler] si vous voulez annuler le lancement du processus de sauvegarde (laisser vide si vous voulez séléctionner un autre processus)

# StartSave.Cancel
source: Launch of the save process canceled
fr: Lancement du processus de sauvegarde annulé

# StartSave.Continue
source: ! Press enter to continue !
fr: ! Appuyer sur entrée pour continuer !

# StartSave.Error
source: Error(s) during the save process
fr: => Erreur au moment du lancement du processus de sauvegarde

# StartSave.Name
source: Enter the name of the backup process to launch
fr: Entrer le nom du processus de sauvegarde à lancer

# StartSave.StartProcess
source: => Backup process started
fr: => Processus de sauvegarde lancé

# StartSave.Sucess
source: => The save process has been completed successfully
fr: => Le processus de sauvegarde s'est terminé correctement
