Repository: HeyTigrou/Projet-Programmation-Systeme
Catalog: easy_save.Cmd/ConfigurationFiles/Interface_text/*.resx
Languages: fr

# AllProcess.Continue
source: ! Press enter to continue !
fr: \n! Appuyer sur entrée pour continuer !

# AllProcess.EndProcess
source: => All backup processes have been launched correctly
fr: => Tous les processus de sauvegarde ont été lancés corrêctement

# AllProcess.Error
source: backup process could not be started
fr: \n processus de sauvegarde n'a / ont pas pu(s) être lancé(s)

# AllProcess.StartProcess
source: Start all backup processes
fr: Lancement de tout les processus de sauvegarde

# BackupDetails.Continue
source: ! Press enter to continue !
fr: \n! Appuyer sur entrée pour continuer !

# Main.Menu
source: 1| Create a new backup 2| Remove a backup 3| Start a backup 4| Start all available backup processes 5| View backup details 6| Exit
fr: 1| Créer un processus de sauvegarde \n 2| Supprimer une sauvegarde \n 3| Lancer une sauvegarde \n 4| Lancer tous les processus de sauvegarde disponible \n 5| Afficher les détails de sauvegarde \n 6| Quitter

# Main.Option
source: Enter an option:
fr: \nChoisir une option:

# Remove.Continue
source: ! Press enter to continue !
fr: \n! Appuyer sur entrée pour continuer !

# Remove.MissingFile
source: => Backup process not found
fr: \n=> Processus de sauvegarde non trouvé

# Remove.Name
source: Enter the name of the backup to delete
fr: Entrer le nom de la sauvegarde à supprimer

# Remove.SucessRemove
source: => Backup process removed
fr: => Processus de sauvegarde supprimé

# Save.Continue
source: ! Press enter to continue !
fr: \n! Appuyer sur entrée pour continuer !

# Save.ErroLimit
source: => Maximum number of backup processes reached or name or name already taken, unable to create
fr: \n=> Nombre de processus de sauvegarde maximum atteint ou nom déjà choisi, impossible de créer

# Save.ErrorInput
source: => Invalid input, please try again
fr: \n=> Erreur d'entrée, veuillez recommencer

# Save.ErrorSaveType
source: => Invalid save type
fr: \n=> Type de sauvegarde non valide

# Save.Name
source: Enter the name of your save
fr: Entrer le nom de la sauvegarde

# Save.PathDestination
source: Enter the path of the destination
fr: \nEnter le chemin de destination

# Save.PathSave
source: Enter the path of the file to save
fr: \nEnter le chemin de la sauvegarde

# Save.Process
source: => Backup process created
fr: => Processus de sauvegarde crée

# Save.SaveType
source: Enter the type of save(0 : All files / 1 : Changed files)
fr: \nEnter le type de sauvegarde (0 => Tous les fichiers | 1 => Uniquement les fichiers modifiés)

# StartSave.Continue
source: ! Press enter to continue !
fr: \n! Appuyer sur entrée pour continuer !

# StartSave.Error
source: => Error when launching the save process
fr: \n=> Erreur au moment du lancement du processus de sauvegarde

# StartSave.Name
source: Enter the name of the backup process to launch
fr: Entrer le nom du processus de sauvegarde à lancer

# StartSave.StartProcess
source: => Backup process started
fr: => Processus de sauvegarde lancé
